# 2. Acquire the Data

> "Data is the new oil"

- Download from an internal system
- Obtained from client, or other 3rd party
- Extracted from a web-based API
- Scraped from a website
- Extracted from a PDF file
- Gathered manually and recorded

We will using the Global Information System on Alcohol and Health (GISAH) maintained by WHO to answer the questions. 

*The WHO Global Information System on Alcohol and Health (GISAH) provides easy and rapid access to a wide range of alcohol-related health indicators. It is an essential tool for assessing and monitoring the health situation and trends related to alcohol consumption, alcohol-related harm, and policy responses in countries.*

You can see an overview at http://www.who.int/gho/alcohol/en/.


## Principle: Load the Data 

The datasets from GISAH are available at http://apps.who.int/gho/data/node.main.GISAH?lang=en&showonly=GISAH

We want the alcohol consumption by country

- Recorded alcohol per capita consumption, 1960-1979 by country - http://apps.who.int/gho/data/node.main.A1025?lang=en&showonly=GISAH

- Recorded alcohol per capita consumption, 1980-1999 by country - http://apps.who.int/gho/data/node.main.A1024?lang=en&showonly=GISAH

- Recorded alcohol per capita consumption, 2000 onwards by country  http://apps.who.int/gho/data/node.main.A1026?lang=en&showonly=GISAH

In [375]:
# Import the libraries we need, which is Pandas and Numpy
import pandas as pd
import numpy as np

In [376]:
df1 = pd.read_csv('data/drinks2000.csv')

In [377]:
df1.head()

,Country; Data Source; Beverage Types,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2015,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2014,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2013,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2012,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2011,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2010,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2009,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2008,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2007,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2006,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2005,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2004,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2003,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2002,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2001,Recorded alcohol per capita (15+) consumption (in litres of pure alcohol); 2000
0,Afghanistan; Data source; All types,NaN,NaN,0.01,0.01,0.01,0.01,0.01,0.03,0.02,0.03,0.02,0.02,0.01,0.01,0,0
1,Afghanistan; Data source; Beer,NaN,NaN,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.02,0,0,0,0
2,Afghanistan; Data source; Wine,NaN,NaN,0.00,0.00,0.00,0,0,0,0.01,0.01,0,0,0,0,0,0
3,Afghanistan; Data source; Spirits,NaN,NaN,0.00,0.00,0.00,0,0,0.02,0,0.01,0.01,0,0.01,0,0,0
4,Afghanistan; Data source; Other alcoholic beve...,NaN,NaN,0.00,0.00,0.00,0,0,0,0,0,0,0,0,0,0,0

In [378]:
df1.shape

(984, 17)

## Principle: Fix the Column Header

In [379]:
years1 = list(range(2015, 1999, -1))

In [380]:
years1

[2015,
 2014,
 2013,
 2012,
 2011,
 2010,
 2009,
 2008,
 2007,
 2006,
 2005,
 2004,
 2003,
 2002,
 2001,
 2000]

In [381]:
header1 = ['description']

In [382]:
header1.extend(years1)

In [383]:
header1

['description',
 2015,
 2014,
 2013,
 2012,
 2011,
 2010,
 2009,
 2008,
 2007,
 2006,
 2005,
 2004,
 2003,
 2002,
 2001,
 2000]

In [384]:
df1.columns = header1

In [385]:
df1.head()

,description,2015,2014,2013,2012,2011,2010,2009,2008,2007,2006,2005,2004,2003,2002,2001,2000
0,Afghanistan; Data source; All types,NaN,NaN,0.01,0.01,0.01,0.01,0.01,0.03,0.02,0.03,0.02,0.02,0.01,0.01,0,0
1,Afghanistan; Data source; Beer,NaN,NaN,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.02,0,0,0,0
2,Afghanistan; Data source; Wine,NaN,NaN,0.00,0.00,0.00,0,0,0,0.01,0.01,0,0,0,0,0,0
3,Afghanistan; Data source; Spirits,NaN,NaN,0.00,0.00,0.00,0,0,0.02,0,0.01,0.01,0,0.01,0,0,0
4,Afghanistan; Data source; Other alcoholic beve...,NaN,NaN,0.00,0.00,0.00,0,0,0,0,0,0,0,0,0,0,0

### Exercise 
1. Load the drinks1960 and drinks1980 csv files and fix the column header

In [386]:
df2 = pd.read_csv('data/drinks1980.csv')
years2 = list(range(1999, 1979, -1))
header2 = ['description']
header2.extend(years2)
df2.columns = header2
df2.head()

,description,1999,1998,1997,1996,1995,1994,1993,1992,1991,...,1989,1988,1987,1986,1985,1984,1983,1982,1981,1980
0,Afghanistan; Data source; All types,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,Afghanistan; Data source; Beer,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Afghanistan; Data source; Wine,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,Afghanistan; Data source; Spirits,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,Afghanistan; Data source; Other alcoholic beve...,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [387]:
df3 = pd.read_csv('data/drinks1960.csv')
years3 = list(range(1979, 1959, -1))
header3 = ['description']
header3.extend(years3)
df3.columns = header3
df3.head()

,description,1979,1978,1977,1976,1975,1974,1973,1972,1971,...,1969,1968,1967,1966,1965,1964,1963,1962,1961,1960
0,Afghanistan; Data source; All types,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,NaN
1,Afghanistan; Data source; Beer,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,NaN
2,Afghanistan; Data source; Wine,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,NaN
3,Afghanistan; Data source; Spirits,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,NaN
4,Afghanistan; Data source; Other alcoholic beve...,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,NaN

# 3. Refine the Data
 
> "Data is messy"

We will be performing the following operation on our Onion price to refine it
- **Remove** e.g. remove redundant data from the data frame
- **Derive** e.g. Country and Beverage from the description field
- **Missing** e.g. Check for missing or incomplete data
- **Merge** e.g. Take the three dataframes and make them one
- **Filter** e.g. exclude based on location

Other stuff you may need to do to refine are...
- **Parse** e.g. extract date from year and month column
- **Quality** e.g. Check for duplicates, accuracy, unusual data
- **Convert** e.g. free text to coded value
- **Calculate** e.g. percentages, proportion
- **Aggregate** e.g. rollup by year, cluster by area
- **Sample** e.g. extract a representative data
- **Summary** e.g. show summary stats like mean

## Principle: `melt` to convert from Wide format to Tall format
We will need to convert the data frame from wide format to tall format (and vice versa). This is needed as we want to combine the three data frame and we can only do that once we have the data in a tall format

![](img/wideformat.png)

In [388]:
df1.head()

,description,2015,2014,2013,2012,2011,2010,2009,2008,2007,2006,2005,2004,2003,2002,2001,2000
0,Afghanistan; Data source; All types,NaN,NaN,0.01,0.01,0.01,0.01,0.01,0.03,0.02,0.03,0.02,0.02,0.01,0.01,0,0
1,Afghanistan; Data source; Beer,NaN,NaN,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.02,0,0,0,0
2,Afghanistan; Data source; Wine,NaN,NaN,0.00,0.00,0.00,0,0,0,0.01,0.01,0,0,0,0,0,0
3,Afghanistan; Data source; Spirits,NaN,NaN,0.00,0.00,0.00,0,0,0.02,0,0.01,0.01,0,0.01,0,0,0
4,Afghanistan; Data source; Other alcoholic beve...,NaN,NaN,0.00,0.00,0.00,0,0,0,0,0,0,0,0,0,0,0

In [389]:
df1 = pd.melt(df1, id_vars=['description'], var_name='year')

In [390]:
df1.head()

                                         description  year value
0                Afghanistan; Data source; All types  2015   NaN
1                     Afghanistan; Data source; Beer  2015   NaN
2                     Afghanistan; Data source; Wine  2015   NaN
3                  Afghanistan; Data source; Spirits  2015   NaN
4  Afghanistan; Data source; Other alcoholic beve...  2015   NaN

In [391]:
df2 = pd.melt(df2, id_vars=['description'], var_name='year')
df3 = pd.melt(df3, id_vars=['description'], var_name='year')

## Principle: `append` one dataframe to another

In [392]:
df1.shape

(15744, 3)

In [393]:
df2.shape

(18900, 3)

In [394]:
df = df1.append(df2)

In [395]:
df.shape

(34644, 3)

In [396]:
df = df.append(df3)

In [397]:
df.shape

(48244, 3)

## Principle: `str` to extract text from a strings

String manipulation is very common and we often need to extract a substring from a long string. In this case, we want to get the country and type of beverage from the description

In [398]:
df.head()

                                         description  year value
0                Afghanistan; Data source; All types  2015   NaN
1                     Afghanistan; Data source; Beer  2015   NaN
2                     Afghanistan; Data source; Wine  2015   NaN
3                  Afghanistan; Data source; Spirits  2015   NaN
4  Afghanistan; Data source; Other alcoholic beve...  2015   NaN

In [399]:
df['country'] = df.description.str.split(';').str[0]

In [400]:
df.head()

                                         description  year value      country
0                Afghanistan; Data source; All types  2015   NaN  Afghanistan
1                     Afghanistan; Data source; Beer  2015   NaN  Afghanistan
2                     Afghanistan; Data source; Wine  2015   NaN  Afghanistan
3                  Afghanistan; Data source; Spirits  2015   NaN  Afghanistan
4  Afghanistan; Data source; Other alcoholic beve...  2015   NaN  Afghanistan

In [401]:
df['beverage'] = df.description.str.split(";").str[-1]

In [402]:
df.tail()

,description,year,value,country,beverage
13595,Zimbabwe; Data source; All types,1960,NaN,Zimbabwe,All types
13596,Zimbabwe; Data source; Beer,1960,NaN,Zimbabwe,Beer
13597,Zimbabwe; Data source; Wine,1960,NaN,Zimbabwe,Wine
13598,Zimbabwe; Data source; Spirits,1960,NaN,Zimbabwe,Spirits
13599,Zimbabwe; Data source; Other alcoholic beverages,1960,NaN,Zimbabwe,Other alcoholic beverages

We can now drop the description column from our dataframe

In [403]:
df.drop('description', axis = 1, inplace= True)

In [404]:
df.head()

   year value      country                    beverage
0  2015   NaN  Afghanistan                   All types
1  2015   NaN  Afghanistan                        Beer
2  2015   NaN  Afghanistan                        Wine
3  2015   NaN  Afghanistan                     Spirits
4  2015   NaN  Afghanistan   Other alcoholic beverages

## Principle: Dealing with Missing Values

By “missing” it simply mean null or “not present for whatever reason”. Many data sets have missing data, either because it exists and was not collected or it never existed. Pandas default way for treating missing value is to mark it as  `NaN`

In [296]:
df.dtypes

year        object
value       object
country     object
beverage    object
dtype: object

In [326]:
df.year.unique()

array([2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006, 2005,
       2004, 2003, 2002, 2001, 2000, 1999, 1998, 1997, 1996, 1995, 1994,
       1993, 1992, 1991, 1990, 1989, 1988, 1987, 1986, 1985, 1984, 1983,
       1982, 1981, 1980, 1979, 1978, 1977, 1976, 1975, 1974, 1973, 1972,
       1971, 1970, 1969, 1968, 1967, 1966, 1965, 1964, 1963, 1962, 1961,
       1960], dtype=object)

In [332]:
df.year = pd.to_numeric(df.year)

In [333]:
df.dtypes

year         int64
value       object
country     object
beverage    object
dtype: object

In [334]:
df.head()

   year value      country                    beverage
0  2015   NaN  Afghanistan                   All types
1  2015   NaN  Afghanistan                        Beer
2  2015   NaN  Afghanistan                        Wine
3  2015   NaN  Afghanistan                     Spirits
4  2015   NaN  Afghanistan   Other alcoholic beverages

Lets check in the value whether we have numeric or not

In [323]:
df.value.unique()

array([nan, 8.7, 3.29, ..., '20.56', '19.24', '17.24'], dtype=object)

In [347]:
df[df.value.str.isnumeric() == False].shape

(34011, 4)

We will use `pd.to_numeric` which will coerce to NaN everything that cannot be converted to a numeric value, so strings that represent numeric values will not be removed. For example '1.25' will be recognized as the numeric value 1.25

In [352]:
df.value = pd.to_numeric(df.value, errors='coerce')

In [353]:
df.value.unique()

array([   nan,   8.7 ,   3.29, ...,  20.56,  19.24,  17.24])

In [356]:
df.dtypes

year          int64
value       float64
country      object
beverage     object
dtype: object

In [407]:
df.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia (Plurinational State of)', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'Brunei Darussalam', 'Bulgaria',
       'Burkina Faso', 'Burundi', "Cote d'Ivoire", 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China', 'Colombia', 'Comoros', 'Congo',
       'Cook Islands', 'Costa Rica', 'Croatia', 'Cuba', 'Cyprus',
       'Czech Republic', "Democratic People's Republic of Korea",
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia', 'Fiji',
       'Finland', 'France', 'Gabon', 'Gambia', 'Georgia', 'Germany',
       'Ghana', 'Greece', 'Grenada', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras', 'Hungary',
       'Iceland', 'India', 'Indonesia', 'Iran (Islamic Republic of)',
       'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'Kuwait', 'Kyrgyzstan',
       "Lao People's Democratic Republic", 'Latvia', 'Lebanon', 'Lesotho',
       'Liberia', 'Libya', 'Lithuania', 'Luxembourg', 'Madagascar',
       'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta',
       'Marshall Islands', 'Mauritania', 'Mauritius', 'Mexico',
       'Micronesia (Federated States of)', 'Monaco', 'Mongolia',
       'Montenegro', 'Morocco', 'Mozambique', 'Myanmar', 'Namibia',
       'Nauru', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'Niue', 'Norway', 'Oman', 'Pakistan', 'Palau',
       'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines',
       'Poland', 'Portugal', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'Romania', 'Russian Federation', 'Rwanda',
       'Saint Kitts and Nevis', 'Saint Lucia',
       'Saint Vincent and the Grenadines', 'Samoa', 'San Marino',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'Spain', 'Sri Lanka',
       'Sudan', 'Suriname', 'Swaziland', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'The former Yugoslav republic of Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Tuvalu', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom of Great Britain and Northern Ireland',
       'United Republic of Tanzania', 'United States of America',
       'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela (Bolivarian Republic of)', 'Viet Nam', 'Yemen', 'Zambia',
       'Zimbabwe'], dtype=object)

In [417]:
df.beverage.unique()

array([' All types', ' Beer', ' Wine', ' Spirits',
       ' Other alcoholic beverages'], dtype=object)

In [418]:
# Convert from an np array to a list
beverage_old = df.beverage.unique().tolist()

In [419]:
beverage_old

[' All types', ' Beer', ' Wine', ' Spirits', ' Other alcoholic beverages']

In [420]:
# Create a new list with white space removed and shorter names
beverage_new = ['all', 'beer', 'wine', 'spirits', 'others']

In [421]:
beverage_new

['all', 'beer', 'wine', 'spirits', 'others']

In [422]:
df.beverage = df.beverage.replace(beverage_old, beverage_new)

## Principle: `filter` for rows and/or `select` columns in a dataframe

- To selecte the rows from the dataframe

![](img/subsetrows.png)

- verb: **`select`** for columns

![](img/subsetcolumns.png)

In [423]:
df2015 = df[df.year == 2015]

In [424]:
df2015.head()

   year value      country beverage
0  2015   NaN  Afghanistan      all
1  2015   NaN  Afghanistan     beer
2  2015   NaN  Afghanistan     wine
3  2015   NaN  Afghanistan  spirits
4  2015   NaN  Afghanistan   others

In [425]:
dfBeer = df[df.beverage == 'beer']

In [428]:
df2015Beer = df[(df.year == 2015) & (df.beverage == 'beer')]

In [429]:
df2015Beer.head()

    year value      country beverage
1   2015   NaN  Afghanistan     beer
6   2015   NaN      Albania     beer
11  2015   NaN      Algeria     beer
16  2015   NaN      Andorra     beer
21  2015   NaN       Angola     beer